jadhavrohit924/connectedhomeip/examples/bridge-app/esp32/main/main.cpp
constexpr CommandId groupsIncomingCommands[] = {
    app::Clusters::Groups::Commands::AddGroup::Id,
    app::Clusters::Groups::Commands::RemoveGroup::Id,
    app::Clusters::Groups::Commands::RemoveAllGroups::Id,
    app::Clusters::Groups::Commands::GetGroupMembership::Id,
    app::Clusters::Groups::Commands::ViewGroup::Id,
    kInvalidCommandId,
};

constexpr CommandId groupsOutgoingCommands[] = {
    app::Clusters::Groups::Commands::AddGroupResponse::Id,
    app::Clusters::Groups::Commands::RemoveGroupResponse::Id,
    app::Clusters::Groups::Commands::GetGroupMembershipResponse::Id,
    app::Clusters::Groups::Commands::ViewGroupResponse::Id,
    kInvalidCommandId,
};

// Declare Scenes cluster attributes
DECLARE_DYNAMIC_ATTRIBUTE_LIST_BEGIN(scenesAttrs)
    DECLARE_DYNAMIC_ATTRIBUTE(ScenesManagement::Attributes::SceneTableSize::Id, INT16U, sizeof(kSceneTableSize), kSceneTableSize), /* SceneTableSize */
    DECLARE_DYNAMIC_ATTRIBUTE(ScenesManagement::Attributes::FabricSceneInfo::Id, ARRAY, CHIP_CONFIG_MAX_FABRICS*sizeof(ScenesManagement::Structs::SceneInfoStruct::Type), CHIP_CONFIG_MAX_FABRICS), /* FabricSceneInfo */
DECLARE_DYNAMIC_ATTRIBUTE_LIST_END();

constexpr CommandId scenesIncomingCommands[] = {
    app::Clusters::ScenesManagement::Commands::AddScene::Id,
    app::Clusters::ScenesManagement::Commands::ViewScene::Id,
    app::Clusters::ScenesManagement::Commands::RemoveScene::Id,
    app::Clusters::ScenesManagement::Commands::RemoveAllScenes::Id,
    app::Clusters::ScenesManagement::Commands::StoreScene::Id,
    app::Clusters::ScenesManagement::Commands::RecallScene::Id,
    app::Clusters::ScenesManagement::Commands::GetSceneMembership::Id,
    kInvalidCommandId,
};

constexpr CommandId scenesOutgoingCommands[] = {
    app::Clusters::ScenesManagement::Commands::AddSceneResponse::Id,
    app::Clusters::ScenesManagement::Commands::ViewSceneResponse::Id,
    app::Clusters::ScenesManagement::Commands::RemoveSceneResponse::Id,
    app::Clusters::ScenesManagement::Commands::RemoveAllScenesResponse::Id,
    app::Clusters::ScenesManagement::Commands::StoreSceneResponse::Id,
    app::Clusters::ScenesManagement::Commands::GetSceneMembershipResponse::Id,
    kInvalidCommandId,
};

// Declare Identify cluster attributes
DECLARE_DYNAMIC_ATTRIBUTE_LIST_BEGIN(identifyAttrs)
DECLARE_DYNAMIC_ATTRIBUTE(Identify::Attributes::IdentifyTime::Id, INT16U, 1, 0), /* IdentifyTime */
    DECLARE_DYNAMIC_ATTRIBUTE(Identify::Attributes::IdentifyType::Id, INT8U, 1, 0), /* IdentifyType */
    DECLARE_DYNAMIC_ATTRIBUTE_LIST_END();

constexpr CommandId identifyIncomingCommands[] = {
    app::Clusters::Identify::Commands::Identify::Id,
    kInvalidCommandId,
};

// Declare Level Control cluster attributes
DECLARE_DYNAMIC_ATTRIBUTE_LIST_BEGIN(levelControlAttrs)
DECLARE_DYNAMIC_ATTRIBUTE(LevelControl::Attributes::CurrentLevel::Id, INT8U, 1, 0), /* CurrentLevel */
    DECLARE_DYNAMIC_ATTRIBUTE(LevelControl::Attributes::OnLevel::Id, INT8U, 1, 0), /* OnLevel */
    DECLARE_DYNAMIC_ATTRIBUTE(LevelControl::Attributes::MinLevel::Id, INT8U, 1, 0), /* MinLevel */
    DECLARE_DYNAMIC_ATTRIBUTE(LevelControl::Attributes::MaxLevel::Id, INT8U, 1, 254), /* MaxLevel */
    DECLARE_DYNAMIC_ATTRIBUTE_LIST_END();

constexpr CommandId levelControlIncomingCommands[] = {
    app::Clusters::LevelControl::Commands::MoveToLevel::Id,
    app::Clusters::LevelControl::Commands::Move::Id,
    app::Clusters::LevelControl::Commands::Step::Id,
    app::Clusters::LevelControl::Commands::Stop::Id,
    app::Clusters::LevelControl::Commands::MoveToLevelWithOnOff::Id,
    app::Clusters::LevelControl::Commands::MoveWithOnOff::Id,
    app::Clusters::LevelControl::Commands::StepWithOnOff::Id,
    app::Clusters::LevelControl::Commands::StopWithOnOff::Id,
    kInvalidCommandId,
};

// Declare Color Control cluster attributes
DECLARE_DYNAMIC_ATTRIBUTE_LIST_BEGIN(colorControlAttrs)
DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorMode::Id, INT8U, 1, 0), /* ColorMode */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::Options::Id, BITMAP8, 1, 0), /* Options */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::NumberOfPrimaries::Id, INT8U, 1, 0), /* NumberOfPrimaries */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::EnhancedColorMode::Id, INT8U, 1, 0), /* EnhancedColorMode */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorCapabilities::Id, BITMAP8, 1, 0), /* ColorCapabilities */
    DECLARE_DYNAMIC_ATTRIBUTE_LIST_END();

// Define you accepted commands for the Color Control cluster
constexpr CommandId colorControlIncomingCommands[] = {
    kInvalidCommandId,
};

// Declare Color Control with Color Temperature cluster attributes
DECLARE_DYNAMIC_ATTRIBUTE_LIST_BEGIN(colorControlWithColorTemperatureAttrs)
DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorMode::Id, INT8U, 1, 0), /* ColorMode */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::Options::Id, BITMAP8, 1, 0), /* Options */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::NumberOfPrimaries::Id, INT8U, 1, 0), /* NumberOfPrimaries */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::EnhancedColorMode::Id, INT8U, 1, 0), /* EnhancedColorMode */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorCapabilities::Id, BITMAP8, 1, 0), /* ColorCapabilities */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::FeatureMap::Id, BITMAP32, 4, 16), /* FeatureMap */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorTemperatureMireds::Id, INT16U, 2, 0), /* ColorTemperatureMireds */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorTempPhysicalMinMireds::Id, INT16U, 2, 0), /* ColorTempPhysicalMinMireds */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::ColorTempPhysicalMaxMireds::Id, INT16U, 2, 0), /* ColorTempPhysicalMaxMireds */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::CoupleColorTempToLevelMinMireds::Id, INT16U, 2, 0), /* CoupleColorTempToLevelMinMireds */
    DECLARE_DYNAMIC_ATTRIBUTE(ColorControl::Attributes::StartUpColorTemperatureMireds::Id, INT16U, 2, 0), /* StartUpColorTemperatureMireds */
    DECLARE_DYNAMIC_ATTRIBUTE_LIST_END();

