jadhavrohit924/connectedhomeip/examples/bridge-app/esp32/main/main.cpp
// Lookup table mapping CLI type names to their endpoint/device-type definitions.
// The cluster count is used to allocate the correct number of DataVersion entries.
static const BridgedDeviceTypeInfo kDeviceTypeTable[] = {
    { "onoff_light", "OnOff Light", &bridgedLightEndpoint, gBridgedOnOffDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedOnOffDeviceTypes), MATTER_ARRAY_SIZE(bridgedLightClusters) },
    { "dimmable_light", "Dimmable Light", &bridgedDimmableLightEndpoint, gBridgedDimmableDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedDimmableDeviceTypes), MATTER_ARRAY_SIZE(bridgedDimmableLightClusters) },
    { "extended_color_light", "Extended Color Light", &bridgedExtendedColorLightEndpoint, gBridgedExtColorDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedExtColorDeviceTypes), MATTER_ARRAY_SIZE(bridgedExtendedColorLightClusters) },
    { "color_temperature_light", "Color Temperature Light", &bridgedColorTemperatureLightEndpoint, gBridgedColorTempDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedColorTempDeviceTypes), MATTER_ARRAY_SIZE(bridgedColorTemperatureLightClusters) },
    { "fan", "Fan", &bridgedFanEndpoint, gBridgedFanDeviceTypes, MATTER_ARRAY_SIZE(gBridgedFanDeviceTypes),
      MATTER_ARRAY_SIZE(bridgedFanClusters) },
    { "window_covering", "Window Covering", &bridgedWindowCoveringEndpoint, gBridgedWindowCoveringDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedWindowCoveringDeviceTypes), MATTER_ARRAY_SIZE(bridgedWindowCoveringClusters) },
    { "thermostat", "Thermostat", &bridgedThermostatEndpoint, gBridgedThermostatDeviceTypes,
      MATTER_ARRAY_SIZE(gBridgedThermostatDeviceTypes), MATTER_ARRAY_SIZE(bridgedThermostatClusters) },
};

static const BridgedDeviceTypeInfo * FindDeviceTypeInfo(const char * typeName)
{
    for (const auto & entry : kDeviceTypeTable)
    {
        if (strcasecmp(typeName, entry.name) == 0)
        {
            return &entry;
        }
    }
    return nullptr;
}

static CHIP_ERROR BridgeAddHandler(int argc, char ** argv)
{
    if (argc < 1 || argc > 3)
    {
        ESP_LOGE(TAG, "Usage: bridge add <type> [name] [location]");
        ESP_LOGE(TAG, "  type: onoff_light, dimmable_light, extended_color_light,");
        ESP_LOGE(TAG, "        color_temperature_light, fan, window_covering, thermostat");
        ESP_LOGE(TAG, "  name: optional device name");
        ESP_LOGE(TAG, "  location: optional location (default: 'Room')");
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    const BridgedDeviceTypeInfo * typeInfo = FindDeviceTypeInfo(argv[0]);
    if (typeInfo == nullptr)
    {
        ESP_LOGE(TAG, "Unknown device type '%s'", argv[0]);
        ESP_LOGE(TAG, "  Supported: onoff_light, dimmable_light, extended_color_light,");
        ESP_LOGE(TAG, "             color_temperature_light, fan, window_covering, thermostat");
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    if (gBridgedDeviceCount >= kMaxBridgedDevices)
    {
        ESP_LOGE(TAG, "Max bridged devices reached (%u). Cannot add more.", kMaxBridgedDevices);
        return CHIP_ERROR_NO_MEMORY;
    }

    char defaultName[32];
    const char * name;
    if (argc >= 2)
    {
        name = argv[1];
    }
    else
    {
        snprintf(defaultName, sizeof(defaultName), "%s %u", typeInfo->defaultPrefix,
                 static_cast<unsigned>(gBridgedDeviceCount + 1));
        name = defaultName;
    }

    const char * location = (argc >= 3) ? argv[2] : "Room";

    Device * newDevice = new (std::nothrow) Device(name, location);
    if (newDevice == nullptr)
    {
        ESP_LOGE(TAG, "Failed to allocate memory for new device");
        return CHIP_ERROR_NO_MEMORY;
    }

    DataVersion * newDataVersions = new (std::nothrow) DataVersion[typeInfo->clusterCount];
    if (newDataVersions == nullptr)
    {
        delete newDevice;
        ESP_LOGE(TAG, "Failed to allocate memory for data versions");
        return CHIP_ERROR_NO_MEMORY;
    }
    memset(newDataVersions, 0, sizeof(DataVersion) * typeInfo->clusterCount);

    newDevice->SetReachable(true);
    newDevice->SetChangeCallback(&HandleDeviceStatusChanged);

    // AddDeviceEndpoint stores newDevice in gDevices[result] internally,
    // so we only need to track the data versions at the same index.
    int result = AddDeviceEndpoint(
        newDevice, typeInfo->endpoint,
        Span<const EmberAfDeviceType>(typeInfo->deviceTypes, typeInfo->deviceTypesCount),
        Span<DataVersion>(newDataVersions, typeInfo->clusterCount), 1);
    if (result < 0)
    {
        delete newDevice;
        delete[] newDataVersions;
        ESP_LOGE(TAG, "Failed to add device endpoint - no available endpoints");
        return CHIP_ERROR_ENDPOINT_POOL_FULL;
    }

    gBridgedDataVersions[result] = newDataVersions;
    gBridgedDeviceCount++;

    ESP_LOGI(TAG, "Added %s '%s' @ %s (endpoint %d) [%u/%u]", typeInfo->name, name, location, newDevice->GetEndpointId(),
             gBridgedDeviceCount, kMaxBridgedDevices);

    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeRemoveHandler(int argc, char ** argv)
{
    if (argc != 1)
    {
        ESP_LOGE(TAG, "Usage: bridge remove <endpoint>");
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    char * end;
    chip::EndpointId endpointId = strtoul(argv[0], &end, 10);
    if (end == argv[0] || *end != '\0' || endpointId > 0xFFFF)
    {
        ESP_LOGE(TAG, "Invalid endpoint ID: %s (must be 0-65535)", argv[0]);
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    uint16_t index;
    CHIP_ERROR err = FindDeviceByEndpoint(endpointId, index);
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "No device at endpoint %u", endpointId);
        return err;
    }

    const char * name = gDevices[index]->GetName();
    err               = RemoveDeviceEndpoint(gDevices[index]);
    if (err == CHIP_NO_ERROR)
    {
        ESP_LOGI(TAG, "Removed '%s' from endpoint %u", name, endpointId);
        delete gDevices[index];
        delete[] gBridgedDataVersions[index];
        gDevices[index]             = nullptr;
        gBridgedDataVersions[index] = nullptr;
        gBridgedDeviceCount--;
    }
    else
    {
        ESP_LOGE(TAG, "Failed to remove '%s'", name);
        return err;
    }

